{
    "TECHNICAL_SKILLS": {
        "displayName": "Technical skills",
        "category": "Technical skills",
        "description": "As member of the engineering team, your technical capabilities and your expertise in technologies, systems and tooling are key components that will define your success at your role.",
        "milestones": [
            {
                "summary": "You work effectively within existing codebases, following current best practices",
                "signals": [
                    "You have a general knowledge of core CS concepts and the technologies used in the team.",
                    "You work primarily on tightly scoped, routine problems and participate in the technical design of features.",
                    "Your focus is on growing as an engineer, by learning existing tools, methodologies and processes.",
                    "You rarely make the same mistake twice, learn quickly and make steady progress without the need for constant significant feedback from more senior engineers."
                ]
            },
            {
                "summary": "You develop features of moderate complexity in existing systems",
                "signals": [
                    "You have a very good knowledge of the technologies that we use and make well-reasoned design decisions and trade-offs in your area.",
                    "You follow established patterns and approaches within existing code bases with ease.",
                    "You work mostly on clearly defined and scoped individual features or problems and You don't normally get stuck while debugging.",
                    "You demonstrate knowledge of industry trends, our infrastructure and our build system, being proficient with git, deployer, CI and testing tools."
                ]
            },
            {
                "summary": "You design standalone systems of moderate complexity, or implements new features in existing systems",
                "signals": [
                    "You are the go-to expert in one area of the codebase; understand the broad architecture of the entire system and act as primary maintainer for existing systems.",
                    "You provide technical advice and weighs in on technical decisions that impact other teams or the company at large. You research and propose new technologies.",
                    "You are sought out for technical guidance; you anticipate technical issues at the product level and make architectural and design decisions to avoid them."
                ]
            },
            {
                "summary": "You build complex, business-critical systems used widely within the organization",
                "signals": [
                    "You own and are an expert on entire products or on large sections of our codebase.",
                    "You are capable of debugging the hairiest problems that the team encounters.",
                    "You are able to recognize and make trade-offs with respect to the whole system.",
                    "You understand deeply the entire architecture for a major part of our business and are able to articulate clearly the scaling and reliability limits of that area."
                ]
            },
            {
                "summary": "You build complex systems and technology used widely within the organization and by others in the industry",
                "signals": [
                    "You have a record of creating sweeping improvements in stability, performance, and scalability across major business-critical systems.",
                    "You are recognized widely in the industry for material contributions to the state of the art.",
                    "You are fully capable of designing, owning, and running entirely new, novel systems and technologies from scratch."
                ]
            }
        ]
    },
    "QUALITY": {
        "displayName": "Software quality",
        "category": "Technical skills",
        "description": "The Consortium for IT Software Quality (CISQ) defines four important indicators of software quality; reliability, efficiency, security and maintainability.",
        "milestones": [
            {
                "summary": "You write well tested, bug-free code.",
                "signals": [
                    "You write correct and clean code with the help of others.",
                    "You consistently follow stated best practices and test new code thoroughly, both locally and in production.",
                    "You document your work appropriately."
                ]
            },
            {
                "summary": "You work proactively to identifiy risk in existing systems increasing the robustness and reliability of codebases",
                "signals": [
                    "You refactor existing code to make it more testable.",
                    "You delete unnecessary code.",
                    "You add tests for uncovered areas."
                ]
            },
            {
                "summary": "You empower the team to improve quality.",
                "signals": [
                    "You research, propose and implement tooling to improve quality.",
                    "You introduce testing frameworks to previously untested codebases.",
                    "You provides useful feedback on MRs to encourage others to improve code quality."
                ]
            },
            {
                "summary": "You are the operational responsible for ensuring quality of projects across the company.",
                "signals": [
                    "You are ultimately responsible for all critical infrastructure (databases, servers, etc) and ensure continued support and uptime of these systems."
                ]
            },
            {
                "summary": "You promote the importance of quality across the organization.",
                "signals": [
                    "You define policies for engineering that encourage quality work.",
                    "You identify and eliminate single points of failure throughout the organization.",
                    "You secure time and resources from the organisation to support great quality."
                ]
            }
        ]
    },
    "COMMUNICATION": {
        "displayName": "Communication",
        "category": "Communication and leadership",
        "description": "You share the right amount of information with the right people, at the right time, and listen effectively.",
        "milestones": [
            {
                "summary": "You communicate effectively progress and blockers within the engineering team.",
                "signals": [
                    "You are effective in communicating status to the team and your manager.",
                    "You communicates assumptions and request clarification on tasks up front to minimize the need for rework.",
                    "You raise issues when you come across them.",
                    "You ask for feedback and help from others and are eager to learn and find ways to improve.",
                    "You write clear and concise commit messages and merge requests."
                ]
            },
            {
                "summary": "You communicate effectively progress and blockers with project stakeholders.",
                "signals": [
                    "You choose the appropriate communication method (e.g. email, instant message, face to face)",
                    "You understand how you work fits in to the larger goals of the organization and identify problems with requirements.",
                    "You clearly articulates the purpose of your work to technical and non-technical colleagues",
                    "You communicate effectively cross functions; you able to work well with Product, Design, Marketing, Editorial or Sales as necessary.",
                    "You proactively identify problems with requirements (lack of clarity, inconsistencies, technical limitations) for your own work and communicate these issues early to help course-correct."
                ]
            },
            {
                "summary": "You proactively share information and facilitate better communication across teams.",
                "signals": [
                    "You listen and guide debates to help reach a consensus; once a decision is made, you clearly communicate and back that decision.",
                    "You communicate project risks and tradeoffs with nuance.",
                    "You promote good meeting culture."
                ]
            },
            {
                "summary": "You communicates complex ideas skillfully and with nuance, and establishes alignment within the wider organization.",
                "signals": [
                    "You communicate technical decisions through documentation, proposals, talks or meetups.",
                    "You write proposals, complex technical documentation and meeting notes in a clear and succint way.",
                    "You contextualize and clarify ambiguous direction and strategy for others."
                ]
            },
            {
                "summary": "You communicate the mission and vision of the company to execs, the board and the outside world, influencing outcomes at the highest level.",
                "signals": [
                    "You are able to communicate the goals and initiatives of the technical team of TNW borh internal and externally, via talks, meetups and blog posts.",
                    "You identify areas that TNW can share effectively with the outside world and guides the creation of content and communication around these areas."
                ]
            }
        ]
    },
    "LEADERSHIP": {
        "displayName": "Leadership",
        "category": "Communication and leadership",
        "description": "You provide support to colleagues, spread knowledge, develop the team, challenge the status quo and effect positive organizational change.",
        "milestones": [
            {
                "summary": "You identify opportunities for organizational change or product improvements",
                "signals": [
                    "You make yourself available for informal support and advice.",
                    "You raise meaningful questions during meetings.",
                    "You treat colleagues with respect, avoids blame and focus on positive change."
                ]
            },
            {
                "summary": "You effect change to positively impact a few individuals or minor improvement to an existing product or service.",
                "signals": [
                    "You mentor junior engineers via pair programming and code reviews.",
                    "You ensure stakeholders are aware of current blockers.",
                    "You help others break down problems into feasible, tangible next steps.",
                    "You validate ongoing work, provided valuable feedback and sustain motivation."
                ]
            },
            {
                "summary": "You effect change to positively impact a large feature or service.",
                "signals": [
                    "You take ownership of systems, features or processes that nobody owns or wants.",
                    "You avoid siloing information when it can be usefully shared with others.",
                    "You engage in discussions around system design with your peers and propose solutions to challenges."
                ]
            },
            {
                "summary": "You effect change that has a substantial positive impact on the engineering organization or a major product impact.",
                "signals": [
                    "You champion and pioneer new technologies to solve a new class of problems.",
                    "You provide feedback on projects outside of your core area.",
                    "You identify and propose strategies around technical problems affecting the team, communicate standards and get buy-in on solutions."
                ]
            },
            {
                "summary": "You effect change that has a substantial positive impact on the whole company",
                "signals": [
                    "You lead the internal conversation about the direction of major areas of the technology, creating company-wide consensus.",
                    "You are capable of managing and directing larger teams for large, long-running projects.",
                    "You offer effective career advice to team members and empower them to develop themselves.",
                    "You act as a multiplier by building systems, authoring tools, or introducing policies or patterns that raise the level of productivity and happiness of the entire organization."
                ]
            }
        ]
    },
    "ORGANIZATION": {
        "displayName": "Organization and time management",
        "category": "Project management",
        "description": "Delivers well-scoped programs of work that meet their goals, on time, to budget, harmoniously. Prouctivity, Time management, planning, project management",
        "milestones": [
            {
                "summary": "You effectively deliver individual tasks",
                "signals": [
                    "You are capable of prioritizing tasks and avoid getting caught up in unimportant details.",
                    "You show a clear commitment to deliver tasks on time.",
                    "You estimate small tasks accurately.",
                    "You make steady progress on tasks and know when to ask for help in order to get unblocked.",
                    "You are able to own small-to-medium features from technical design through completion."
                ]
            },
            {
                "summary": "You effectively deliver small projects and features",
                "signals": [
                    "You deliver small project or features that you believe are well-baked and bug-free.",
                    "You question and understand the importance of work before starting on it.",
                    "You are capable of giving reasonable estimates for large tasks and stick to them."
                ]
            },
            {
                "summary": "You effectively deliver projects through a small team",
                "signals": [
                    "You delegate tasks to others appropriately.",
                    "You actively remove blockers for yourself and your own team.",
                    "You challenge the purpose and effectiveness of existing processes within your own team and help to make them better.",
                    "You identify and proactively tackle technical debt before it grows into debt that requires significant up-front work to resolve."
                ]
            },
            {
                "summary": "You effectively deliver projects through a large team, or with a significant amount of stakeholders or complexity",
                "signals": [
                    "You scope and stage work into well-defined milestones to avoid a monolithic deliverable.",
                    "You regularly deliver software on-time and are constantly working to make accurate estimates and deliver on those estimates.",
                    "You are known for drama-free launches.",
                    "You own the technical testing and performance plan for your projects."
                ]
            },
            {
                "summary": "You manage major company pushes delivered by multiple teams",
                "signals": [
                    "You consistently deliver large systems involving one or more teams' contribution on time at a high level of quality.",
                    "You are consistently able to reduce the complexity of projects, services, and processes in order to get more done with less work.",
                    "You manage dependencies on other projects and teams.",
                    "You negotiate resourcing compromises with other teams.",
                    "You consider external constraints and business objectives when planning."
                ]
            }
        ]
    },
    "STRATEGIC_THINKING": {
        "displayName": "Strategic thinking",
        "category": "Strategic thinking & Impact",
        "description": "You define processes and structures that enables the strong growth and execution of a diverse engineering organization.",
        "milestones": [
            {
                "summary": "You participate in existing processes, giving meaningful feedback to help the organization improve.",
                "signals": [
                    "You actively participate and makes contribution within organizational processes.",
                    "You identify problems/risks of your own work and that of others."
                ]
            },
            {
                "summary": "You identify opportunities to improve existing processes and promote changes that positively affect the team.",
                "signals": [
                    "You have a very good understanding of the business behind the products you work on.",
                    "You help to set direction and influence decision-making at the project level."
                ]
            },
            {
                "summary": "You develop processes to solve ongoing organizational problems.",
                "signals": [
                    "You anticipate broad technical change and ensure TNW is always ahead of the curve.",
                    "You analyze existing processes for bias and shortfall.",
                    "You set direction at the project/service level and consistently influence decision-making at the business level."
                ]
            },
            {
                "summary": "You think deeply about organizational issues and identifies the dynamics that contribute to them.",
                "signals": [
                    "You set medium-term strategic technical direction, by looking ahead 6-12 months and identifying the areas of greatest need and create plans to improve them.",
                    "You make appropriate buy vs build choices."
                ]
            },
            {
                "summary": "You lead initiatives to address fundamental and complex issues.",
                "signals": [
                    "You identify strategic opportunities that enable TNW to grow as a business.",
                    "You play a key role in developing multi-year technology strategy for complete and critical areas of the business that encompass multiple systems and teams.",
                    "You lead planning and communication for reorgs, creates new structures that provide growth opportunities."
                ]
            }
        ]
    },
    "IMPACT": {
        "displayName": "Impact",
        "category": "Strategic thinking & Impact",
        "description": "These criteria examine the scope of work you are capable of tackling independently and how meaningful your contibutions are to the organization as a whole.",
        "milestones": [
            {
                "summary": "Your impact at this level is focused on task completion and depth in a small area of the code base.",
                "signals": [
                    "Your work is thoroughly reviewed and substantial changes are frequently needed before merging.",
                    "You are self-sufficient in at least one large area of the codebase with a high-level understanding of other components."
                ]
            },
            {
                "summary": "You are starting to have a bigger impact beyond yourself and your immediate projects.",
                "signals": [
                    "Your work is reviewed with the occasional need for material direction or implementation changes.",
                    "You demonstrate end-to-end responsibility on projects of increasing complexity and contribute to common code."
                ]
            },
            {
                "summary": "You impact at this level is focused on end-to-end responsibility for projects of increasing complexity that encompass more than your own tasks.",
                "signals": [
                    "You work require very little oversight beyond high-level direction.",
                    "You take initiative to identify and solve important problems, coordinating with others on cross-cutting technical issues."
                ]
            },
            {
                "summary": "You are expected to have a large impact on the quality of the engineering that the team produces, the code and the design of systems.",
                "signals": [
                    "Your work happens completely autonomously with no regular need for review.",
                    "You have made an obvious positive impact on the entire company's technical trajectory.",
                    "You shape broad architecture, ship multiple large services, complex libraries or major pieces of infrastructure."
                ]
            },
            {
                "summary": "You are expected to have a large impact on the success of the organization a whole.",
                "signals": [
                    "You are capable of identifying the most high-value projects and keeping the team focused on these projects",
                    "Your decisions have a direct impact on the long-term success or failure of TNW. You enable the creation of architecture that enables many potential futures without knowing exactly what the future is."
                ]
            }
        ]
    }
}